
export default [
  {
    id: 1,
    title: 'Правило 1. Следуйте стандартам оформления кода.',
    text: 'У каждого языка программирования есть свой стандарт оформления кода, который говорит,\
          как надо делать отступы, где ставить пробелы и скобки, как называть объекты, как комментировать код и т.д.',
    image: {
      src: 'images/1.png',
      alt: 'Правило 1',
    },
    meta: {
      author: 'Незнайка',
      rating: 3,
      createdAt: '2017-07-22 09:30:26',
      updatedAt: '2017-07-22 09:30:26'
    }
  },
  {
    id: 2,
    title: 'Правило 2. Давайте наглядные имена.',
    text: 'Ограниченные медленными, неуклюжими телетайпами, программисты в древности использовали контракты для имён\
          переменных и процедур, чтобы сэкономить время, стуки по клавишам, чернила и бумагу.',
    image: {
      src: 'images/2.png',
      alt: 'Правило 2',
    },
    meta: {
      author: 'Незнайка',
      rating: 7,
      createdAt: '2017-07-25 10:13:55',
      updatedAt: '2017-07-25 10:13:55'
    }
  },
  {
    id: 3,
    title: 'Правило 3. Комментируйте и документируйте.',
    text: 'Начинайте каждый метод и процедуру с описания в комментарии того, что данный метод или процедура делает,\
          параметров, возвращаемого значения и возможных ошибок и исключений. Опишите в комментариях роль каждого\
          файла и класса, содержимое каждого поля класса и основные шаги сложного кода. Пишите комментарии по мере\
          разработки кода. Если вы полагаете, что напишете их потом, то обманываете самого себя.',
    image: {
      src: 'images/3.png',
      alt: 'Правило 3',
    },
    meta: {
      rating: 2,
      author: 'Незнайка',
      createdAt: '2017-07-30 17:37:12',
      updatedAt: '2017-07-30 17:37:12'
    }
  }
]
